---
kind: type
id: T:Autodesk.Revit.DB.IntegerRange
source: html/89a36389-2694-4d88-d3eb-906cafde1619.htm
---
# Autodesk.Revit.DB.IntegerRange

A class to define a range of a sequence of consecutive integer numbers

## Syntax (C#)
```csharp
public class IntegerRange : IDisposable
```